app/views/students/new.html.erb

		<%= f.label :班级 %><br>
		<%= f.select :team_id, Team.all.collect {|t| [ t.team_name, t.id ] } %>
---
SELECT "teams".* FROM "teams"