app/views/teacher_teams/new.html.erb

	<%= label_tag :班级名称 %>
	<%= label_tag Team.find(params[:team_id]).team_name %><br>
---
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT 1  [["id", nil]]

	<%= label_tag :教师姓名 %>
	<% @teacher_teams=Team.find(params[:team_id]).teacher_teams %>
	<% Teacher.all.each do |teacher| %>
---
SELECT  "teacher_teams".* FROM "teacher_teams" WHERE "teacher_teams"."team_id" = ? AND "teacher_teams"."teacher_id" = ? LIMIT 1  [["team_id", 1], ["teacher_id", 1]]
SELECT  "teachers".* FROM "teachers" WHERE "teachers"."id" = ? LIMIT 1  [["id", nil]]
SELECT "teachers".* FROM "teachers"