app/views/teacher_teams/show.html.erb

	<strong>教师姓名:</strong>
	<%= Teacher.find(@teacher_team.teacher_id).teacher_name %>
---
SELECT  "teachers".* FROM "teachers" WHERE "teachers"."id" = ? LIMIT 1  [["id", nil]]

	<strong>班级名称:</strong>
	<%= Team.find(@teacher_team.team_id).team_name %>
---
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT 1  [["id", nil]]