app/controllers/students_controller.rb

	def create
		@student = Student.new(student_params)
		if @student.save
---
INSERT INTO "students" ("student_name", "sex", "age", "team_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["student_name", "aa"], ["sex", "女"], ["age", 1], ["team_id", 1], ["created_at", "2015-04-24 04:52:24.486257"], ["updated_at", "2015-04-24 04:52:24.486257"]]

	def index
		@team = Team.find(params[:team_id])
---
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = NULL LIMIT 1