app/controllers/teacher_teams_controller.rb

	def create
		teacher_ids = params[:teacher_ids]
		team_id = params[:team_id]
		TeacherTeam.delete_all(["team_id=?",team_id])
		teacher_ids.each do |teacher_id|
			teacher_team = TeacherTeam.new()
			teacher_team.teacher_id = teacher_id
			teacher_team.team_id = team_id
			teacher_team.save
---
DELETE FROM "teacher_teams" WHERE (team_id='1')
INSERT INTO "teacher_teams" ("teacher_id", "team_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["teacher_id", 1], ["team_id", 0], ["created_at", "2015-04-24 09:18:55.320710"], ["updated_at", "2015-04-24 09:18:55.320710"]]

	def show
		@teacher_team = TeacherTeam.find(params[:id])
---
SELECT  "teacher_teams".* FROM "teacher_teams" WHERE "teacher_teams"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT 1  [["id", nil]]