app/controllers/teachers_controller.rb

INSERT INTO "teachers" ("teacher_name", "created_at", "updated_at") VALUES (?, ?, ?)  [["teacher_name", "zhang3"], ["created_at", "2015-04-24 07:35:06.612568"], ["updated_at", "2015-04-24 07:35:06.612568"]]
---
	def create
		@teacher = Teacher.new(teacher_params)
		if @teacher.save

SELECT  "teachers".* FROM "teachers" WHERE "teachers"."id" = ? LIMIT 1  [["id", 1]]
---
	def show
		@teacher =Teacher.find(params[:id])