app/controllers/teams_controller.rb

	def create
		@team = Team.new(team_params)
		if @team.save
---
INSERT INTO "teams" ("team_name", "created_at", "updated_at") VALUES (?, ?, ?)  [["team_name", "11210A02"], ["created_at", "2015-04-23 09:03:42.845381"], ["updated_at", "2015-04-23 09:03:42.845381"]]